# running in C:\digital_design_stack\domains\core_rtl_infrastructure_and_glue\bus_synchronizer\tb\out\formal\bus_synchronizer_formal\model/
read_rtlil design.il
scc -select; simplemap; select -clear
memory_nordff
clk2fflogic
opt_clean
formalff -setundef -clk2ff -ff2anyinit -hierarchy
chformal -live -fair -cover -remove
opt_clean
check
setundef -undriven -anyseq
opt -fast
rename -witness
opt_clean
write_rtlil ../model/design_prep.il
