# running in C:\digital_design_stack\domains\core_rtl_infrastructure_and_glue\async_fifo\tb\out\formal\async_fifo_core_formal/src/
read -formal async_fifo_core.sv async_fifo_core_formal.sv
prep -top async_fifo_core_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
