# running in C:\digital_design_stack\domains\core_rtl_infrastructure_and_glue\reset_synchronizer\tb\out\formal\reset_synchronizer_formal/src/
read -formal reset_synchronizer.sv reset_synchronizer_formal.sv
prep -top reset_synchronizer_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
